In [3]:
!pip install word2number

Collecting word2number
  Downloading word2number-1.1.zip (9.7 kB)
Building wheels for collected packages: word2number
  Building wheel for word2number (setup.py): started
  Building wheel for word2number (setup.py): finished with status 'done'
  Created wheel for word2number: filename=word2number-1.1-py3-none-any.whl size=5580 sha256=28e22db2f372f5e287b07673a46944e44a7d6dc61fc135239d25dd19e54b3abc
  Stored in directory: c:\users\ubmag\appdata\local\pip\cache\wheels\a0\4a\5b\d2f2df5c344ddbecb8bea759872c207ea91d93f57fb54e816e
Successfully built word2number
Installing collected packages: word2number
Successfully installed word2number-1.1

In [10]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from sklearn import linear_model
from word2number.w2n import word_to_num
%matplotlib inline

In [21]:
df = pd.read_csv('hiring.csv')
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [23]:
# cleanning NaNs
df.experience = df.experience.fillna(0)
df['test_score(out of 10)'] = df['test_score(out of 10)'].fillna( df['test_score(out of 10)'].median() )
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0          0                    8.0                           9      50000
1          0                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    8.0                           7      72000
7     eleven                    7.0                           8      80000

In [32]:
# words to numbers
df.experience = df.experience.apply(lambda x : word_to_num( str(x) ))
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    8.0                           7      72000
7          11                    7.0                           8      80000

In [34]:
model = linear_model.LinearRegression()
model.fit(df.drop('salary($)',axis='columns'),df['salary($)'])

LinearRegression()

In [35]:
print("# coeffs : ", model.coef_)
print("# intercept : ", model.intercept_)

# coeffs :  [2812.95487627 1845.70596798 2205.24017467]
# intercept :  17737.26346433771

In [39]:
# Find salary of a candidate with 10 years of experience, 10 in both interview & test scores
model.predict([[ 10, 10, 9]])

array([84171.03347889])